# Data cleansing

During the course of doing data analysis and modeling, a significant amount of time is spent on data preparation:

*   loading
*   cleaning
*   transforming
*   rearraging

Such tasks are often reported to take up 80% or more of an analystâ€™s time.

What can happen with the loading data are
* missing data
* duplicate data
* string manipulation
* other analytical data transformation

## Missing data
---

Some data are imperfect, but it is functional for lot of users

For numeric data,
  Pandas use Nan ``` Nan``` (Not a Number) to represent the number

So call a *sentinel value*

**To detect the missing data**

---


Check by `isNull` value

```python
import pandas as pd
import numpy as np
```



```python
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
```

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

check for null value

```python
string_data.isnull()
```

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

The N/A handling method are provided in the data frame as given

![image-20230906053837943](./assets/image-20230906053837943.png)

### Filtering the data
---


The *NA* data can filtering out as shown

```python
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data
```

In [4]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

The `dropna` method will filter out the NA value

```python
data.dropna()
```

In [5]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

the data frame can be also filter

```python
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data
```

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

The `dropna` method will drop all the rows which contains NA value


```python
cleaned = data.dropna()
cleaned
```

In [7]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

**We** can drop only the line which contains **NA** all the rows usign `how='all'`

```python
data.dropna(how='all')
```

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

**To** drop only columns which contains  all NA, you can use the `axis=1 `parameter

In [9]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

```python
data.dropna(how='all',axis=1)
```

In [10]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Try to add a new column with NA value
```python
data[4] = NA
data
```

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

drop na regarding to the axis
```python
data.dropna(axis=1, how='all')
```

In [12]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Comparing to
```python
data.dropna(axis=1)
```

In [13]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

What are differents of `how='all'` and no `how` parameter

We can drop the rows which may have more data than the given value as we can tolerate for some data missing. `tresh` parameter is required here
```python
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df
```

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.448454       NaN       NaN
1  0.725350       NaN       NaN
2 -2.421874       NaN -0.571457
3  0.162696       NaN -1.851579
4  0.847228 -0.909386 -1.671433
5  0.119214 -0.788088  0.351853
6  1.289231  0.207073 -0.225924

drop all NA
```python
df.dropna()
```

In [15]:
df.dropna()

          0         1         2
4  0.847228 -0.909386 -1.671433
5  0.119214 -0.788088  0.351853
6  1.289231  0.207073 -0.225924

drop only a line which contains non-NA value more than or equal than the treshold
```python
df.dropna(thresh=2)
```

In [16]:
df.dropna(thresh=2)

          0         1         2
2 -2.421874       NaN -0.571457
3  0.162696       NaN -1.851579
4  0.847228 -0.909386 -1.671433
5  0.119214 -0.788088  0.351853
6  1.289231  0.207073 -0.225924

#### Work



Form the file given in `file/property_data.csv`

Provide the given output

In [102]:
df=pd.read_csv('C:/Users/Dell/Desktop/LectureNote/LectureNote_660632028/07. Data Cleansing/file/property_data.csv')

In [103]:
df.head()

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN

output 1
![image-20230906061553156](./assets/image-20230906061553156.png)

In [104]:
df.columns

Index(['PID', 'ST_NUM', 'ST_NAME', 'OWN_OCCUPIED', 'NUM_BEDROOMS', 'NUM_BATH',
       'SQ_FT', 'PRICE'],
      dtype='object')

In [105]:
df['SQ_FT'] = pd.to_numeric(df['SQ_FT'], errors='coerce')
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000.0,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,NaN,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850.0,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700.0,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600.0,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800.0,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950.0,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800.0,NaN

Output 2

![image-20230906061619935](./assets/image-20230906061619935.png)

In [108]:
df['NUM_BATH'] = pd.to_numeric(df['NUM_BATH'], errors='coerce')

df['SQ_FT'] = df['SQ_FT'].astype(str)

df.head()

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1.0,1000.0,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,nan,NaN
2,100003000.0,NaN,LEXINGTON,N,nan,1.0,850.0,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700.0,NaN
4,NaN,203.0,BERKELEY,Y,3,2.0,1600.0,NaN

In [109]:
df['NUM_BEDROOMS'] = df['NUM_BEDROOMS'].astype(str)
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1.0,1000.0,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,nan,NaN
2,100003000.0,NaN,LEXINGTON,N,nan,1.0,850.0,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700.0,NaN
4,NaN,203.0,BERKELEY,Y,3,2.0,1600.0,NaN
5,100006000.0,207.0,BERKELEY,Y,nan,1.0,800.0,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,NaN,950.0,NaN
7,100008000.0,213.0,TREMONT,Y,1,1.0,nan,NaN
8,100009000.0,215.0,TREMONT,Y,na,2.0,1800.0,NaN

Output 3

![image-20230906061652010](./assets/image-20230906061652010.png)

In [110]:
df.drop(columns=['ST_NUM','NUM_BEDROOMS','PRICE'],inplace= True)
df

           PID     ST_NAME OWN_OCCUPIED  NUM_BATH   SQ_FT
0  100001000.0      PUTNAM            Y       1.0  1000.0
1  100002000.0   LEXINGTON            N       1.5     nan
2  100003000.0   LEXINGTON            N       1.0   850.0
3  100004000.0    BERKELEY           12       NaN   700.0
4          NaN    BERKELEY            Y       2.0  1600.0
5  100006000.0    BERKELEY            Y       1.0   800.0
6  100007000.0  WASHINGTON          NaN       NaN   950.0
7  100008000.0     TREMONT            Y       1.0     nan
8  100009000.0     TREMONT            Y       2.0  1800.0

In [111]:
df['NUM_BATH'] = df['NUM_BATH'].astype(str)
df

           PID     ST_NAME OWN_OCCUPIED NUM_BATH   SQ_FT
0  100001000.0      PUTNAM            Y      1.0  1000.0
1  100002000.0   LEXINGTON            N      1.5     nan
2  100003000.0   LEXINGTON            N      1.0   850.0
3  100004000.0    BERKELEY           12      nan   700.0
4          NaN    BERKELEY            Y      2.0  1600.0
5  100006000.0    BERKELEY            Y      1.0   800.0
6  100007000.0  WASHINGTON          NaN      nan   950.0
7  100008000.0     TREMONT            Y      1.0     nan
8  100009000.0     TREMONT            Y      2.0  1800.0

### Filling in missing data

---
Instead of filtering data. Default data may be used.
we can fil the default data for all `NA` values.

```python
df
```

In [17]:
df

          0         1         2
0  0.448454       NaN       NaN
1  0.725350       NaN       NaN
2 -2.421874       NaN -0.571457
3  0.162696       NaN -1.851579
4  0.847228 -0.909386 -1.671433
5  0.119214 -0.788088  0.351853
6  1.289231  0.207073 -0.225924

```python
df.fillna(0)
```

In [18]:
df.fillna(0)

          0         1         2
0  0.448454  0.000000  0.000000
1  0.725350  0.000000  0.000000
2 -2.421874  0.000000 -0.571457
3  0.162696  0.000000 -1.851579
4  0.847228 -0.909386 -1.671433
5  0.119214 -0.788088  0.351853
6  1.289231  0.207073 -0.225924

Or we can define the value for each column
```python
df.fillna({"PID":0.5,"ST_NUM":1.2})
```

In [19]:
df.fillna({"PID":0.5,"ST_NUM":1.2})

          0         1         2
0  0.448454       NaN       NaN
1  0.725350       NaN       NaN
2 -2.421874       NaN -0.571457
3  0.162696       NaN -1.851579
4  0.847228 -0.909386 -1.671433
5  0.119214 -0.788088  0.351853
6  1.289231  0.207073 -0.225924

`fillna` returns a new object, but we can modify the existing object in-place
```python
df.fillna(0,inplace=True)
df
```

In [20]:
df.fillna(0,inplace=True)
df

          0         1         2
0  0.448454  0.000000  0.000000
1  0.725350  0.000000  0.000000
2 -2.421874  0.000000 -0.571457
3  0.162696  0.000000 -1.851579
4  0.847228 -0.909386 -1.671433
5  0.119214 -0.788088  0.351853
6  1.289231  0.207073 -0.225924

We can use the interpolation method to file the value.

Now we create a new data frame with some `NA`
```python
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
```

In [21]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.598993  0.846618  1.034281
1  0.024704  0.353443  0.996690
2  1.253821       NaN -1.554039
3  0.338998       NaN -0.863195
4  1.782292       NaN       NaN
5 -0.811732       NaN       NaN

In [24]:
import numpy as np

Add the interpolation methods for more details google `dataframe fillna`
```python
df.fill()
```

In [27]:
df.fill()

AttributeError: 'DataFrame' object has no attribute 'fill'

we can set limit of filling data that it should not be filled more than limit value.
```python
df.ffill(limit=2)
```

In [23]:
df.ffill(limit=2)

          0         1         2
0 -0.598993  0.846618  1.034281
1  0.024704  0.353443  0.996690
2  1.253821  0.353443 -1.554039
3  0.338998  0.353443 -0.863195
4  1.782292       NaN -0.863195
5 -0.811732       NaN -0.863195

Another fill method can be found in the api
such as `bfill` which is backward fill
```python
df.bfill()
```

In [28]:
df.bfill()

          0         1         2
0 -0.598993  0.846618  1.034281
1  0.024704  0.353443  0.996690
2  1.253821       NaN -1.554039
3  0.338998       NaN -0.863195
4  1.782292       NaN       NaN
5 -0.811732       NaN       NaN

Try

```python
df[6] = [1,2,3]
df
```

In [29]:
df[6] = [1,2,3]

ValueError: Length of values (3) does not match length of index (6)

In [30]:
df

          0         1         2
0 -0.598993  0.846618  1.034281
1  0.024704  0.353443  0.996690
2  1.253821       NaN -1.554039
3  0.338998       NaN -0.863195
4  1.782292       NaN       NaN
5 -0.811732       NaN       NaN

#### Work

---
From the propery_data you have done from the last work
Provide this dataframe

Output 1
![image-20230906063035319](./assets/image-20230906063035319.png)

Output 2
![image-20230906063122466](./assets/image-20230906063122466.png)

Output 3
![image-20230906063412850](./assets/image-20230906063412850.png)

## Data Transformation

We need to transform the data in the format which can manipulate it later.

### Removing Duplicates


Some data duplication must be removed to reduce the unusual behaviour of data
from the provided data

setting up a new dataframe
```python
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data
```

In [31]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The duplicated data is found by

```python
data.duplicated()
```

In [32]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

So we can drop the duplicate code
```python
data.drop_duplicates()
```

In [33]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

we can select key to check the duplicate data, adding a new column to the data frame to see which data is stored
```python
data['v1'] = range(7)
data
```

In [34]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

now check for duplicatoin
```python
data.duplicated()
```

In [35]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

check the dupplicate key only the key in column k1
```python
data.duplicated(['k1'])
```

In [36]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

The previous work keep the first data in the result data frame. We can keep the last entry of the duplicate data using the `keep` parameter
comparing these code?
```python
data.drop_duplicates(['k1','k2'])
```

In [37]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

with
```python
data.drop_duplicates(['k1','k2'],keep='last')
```

In [38]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or mapping

Data can be mapped to a better representation

with the provided data frame
```python
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data
```

In [39]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

The mapping dictionary is provided
```python
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
```

In [40]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

Then we can provide the map as given
```python
lowercased = data['food'].str.lower()
lowercased
```

In [41]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

then mapping the data
```python
data['animal'] = lowercased.map(meat_to_animal)
data
```

In [42]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing value
---

Some value can be replaced, in order to manage the code easier.
For example with the given data frame
```python
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data
```

In [43]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

The value -999 may be the **sentinel** values

The sentinel value is the value which define the state of data but not the real data. For example, the exit point or the `NA` of the value.
```python
data.replace(-999, np.nan)
```

In [44]:
import numpy as np

In [45]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

we can replace multiple data with only one value

```python
data.replace([-999,-1000],np.nan)
```

In [46]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

Or replace different value with different data
```python
data.replace([-999,-1000],[np.nan,0])
```

In [47]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

or using the dictionary to map the request data
```python
data.replace({-999: np.nan, -1000: 0})
```

In [48]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Index

The axis index which we loaded from the different sources may be hard to understand.
So we rename the index name for the better understanding
```python
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
```

In [49]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

We can use the function to change the name of each index
```python
transform = lambda x: x[:4].upper()
new_data_index = data.index.map(transform)
```

In [50]:
transform = lambda x: x[:4].upper()

In [51]:
new_data_index = data.index.map(transform)

To change the index name we have to set the index values
```python
data.index = new_data_index
data
```

In [52]:
data.index = new_data_index
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

Or if we want to rename it instancely (without seeing the new solution first)  we can use the `rename` method
```python
data.rename(index=str.title, columns=str.upper)
```

In [53]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

if we want to change the specific name, using the map for change the index name
```python
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})
```

In [54]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

To save the new name directly using `inplace` method
```python
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data
```

In [55]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

#### Work
---

From the previous work provide this output

Output1

fill PID, and PID as an index
![image-20230906065515528](./assets/image-20230906065515528.png)

Output2
Change the column name to your language
![image-20230906065658172](./assets/image-20230906065658172.png)

### Discretization and Bining
---

Extract data and put it in the bins for analysis

The bin is the range of the data that we want to analyze
create a list as
```python
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
```

In [56]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Then we create a bin
```python
bins = [18, 25, 35, 60, 100]
```

In [57]:
bins = [18, 25, 35, 60, 100]

Then we cut the data in to a bin, the cuts represent the bins for each data
```python
cuts = pd.cut(ages, bins)
cuts
```

In [58]:
cuts = pd.cut(ages, bins)
cuts

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

Instead of using the texts we can see the code (index) of each bins
```python
cuts.codes
```

In [59]:
cuts.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

and the catagories, and the amount of value in each cuts can be shown
```python
cuts.categories
```

In [60]:
cuts.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

We can count the amount of value in each cuts by using `value_counts` method
```python
pd.value_counts(cuts)
```

In [61]:
pd.value_counts(cuts)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

We can set the name of each cuts by passing the arrays of labels
```python
group_names = ['Youth', 'YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)
```

In [62]:
group_names = ['Youth', 'YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

If we pass the integer number instead of the bin edge, it will compute the equal-length bins based on the minimum and maximum values.
```python
data = np.random.rand(20)
pd.cut(data,4,precision=2)
```

In [63]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.72, 0.96], (0.25, 0.49], (0.01, 0.25], (0.01, 0.25], (0.49, 0.72], ..., (0.72, 0.96], (0.01, 0.25], (0.72, 0.96], (0.49, 0.72], (0.25, 0.49]]
Length: 20
Categories (4, interval[float64, right]): [(0.01, 0.25] < (0.25, 0.49] < (0.49, 0.72] < (0.72, 0.96]]

Try counting the value of data
```python
pd.value_counts(pd.cut(data,4,precision=2))
```

In [64]:
pd.value_counts(pd.cut(data,4,precision=2))

(0.01, 0.25]    6
(0.25, 0.49]    5
(0.49, 0.72]    5
(0.72, 0.96]    4
dtype: int64

### Detecting and Filtering Outliers
---


finding the outlining data and filter it out as it may be the error while gathering the data.
Let's start by having the given data
```python
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()
```

In [65]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.047326    -0.016811     0.048925     0.006219
std       1.016533     1.015498     0.982349     1.003610
min      -2.802831    -4.051653    -3.455616    -3.381642
25%      -0.760809    -0.690588    -0.594634    -0.719492
50%      -0.036134     0.013362     0.076505    -0.017250
75%       0.652951     0.676952     0.722345     0.675681
max       3.728721     3.751379     3.476785     3.276876

if we want to find the values in column 2 which the absolute value is exceeded 3
```python
col = data[2]
col[np.abs(col) >3]
```

In [66]:
col = data[2]

In [67]:
col[np.abs(col) >3]

302    3.476785
308   -3.455616
Name: 2, dtype: float64

If we want to get rows which value is exceeding  3, we can use `any` methods
```python
data[(np.abs(data)>3).any(1)]
```

In [68]:
data[(np.abs(data)>3).any(1)]

C:\Users\Dell\AppData\Local\Temp\ipykernel_9500\560825772.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  data[(np.abs(data)>3).any(1)]

            0         1         2         3
197  0.306241 -3.352559  0.824168 -1.117512
302  0.467867 -1.489781  3.476785 -0.357138
308  0.406872  0.432618 -3.455616 -0.051945
313  3.728721  0.693299  0.352627  1.700262
481 -1.314589 -2.256452 -0.594610 -3.381642
507  2.158185  3.396617  0.135994  2.015646
548 -1.087346 -0.751149  1.306062 -3.106105
800 -0.316599 -4.051653 -0.274424  0.287472
803 -1.026568  3.751379 -0.744120 -0.731952
972  0.243124  1.631949  0.474594  3.276876

#### Work
---

From the given property file.
Categorize the size of the hourse as the small house (size is less than 800 sq,ft.),  the medium house (size is between 801-1200 sq.ft) and the large house ( size is more than 1200 sq.ft)

Show the number of each house size

You should ignore the value which is not the number value

# Data Wrangling: Join, Combine, Reshape

## Hierachical Indexing
---


Allow index to have multiple index levels on an axis

Use when working with higher dimensional data ina lower dimensional form


à¹ŠUse this setup configuration

In [69]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

create multiple index as given
```python
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data
```

In [70]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

We can see the index of the data
```python
data.index
```

In [71]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

we can see data in the multi level index to see only some index
```python
data['b']
```

In [72]:
data['b']

1   -0.555730
3    1.965781
dtype: float64

We can see data from the inner level
```python
data['b':'c']
```

In [73]:
data['b':'c']

b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
dtype: float64

The `loc` method can be used to select data from a particular group of rows and columns in the hierachical index
```python
data.loc[['b','d']]
```

In [74]:
data.loc[['b','d']]

b  1   -0.555730
   3    1.965781
d  2    0.281746
   3    0.769023
dtype: float64

We can see data from the inner level
```python
data.loc[:,2]
```

In [75]:
data.loc[:,2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

The slide can be also used
```python
data.loc[:,2]
```

In [76]:
data.loc[:,2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

Hierachical indexing play important role in reshaping data and group-based oepration.

The Hierachical index can be rearragen as the DataFrame using `unstack` methods
```python
data.unstack()
```

In [77]:
data.unstack()

          1         2         3
a -0.204708  0.478943 -0.519439
b -0.555730       NaN  1.965781
c  1.393406  0.092908       NaN
d       NaN  0.281746  0.769023

and the inverse version is `stack`
```python
data.unstack().stack()
```

In [78]:
data.unstack().stack()

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

As the data frame,  axis can have hierachical index
```python
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame
```

In [79]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

The Hierachy level can have names.
```python
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame
```

In [80]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### Work create this data frame

![image-20230907050812483](./assets/image-20230907050812483.png)

## Reordering and Sorting Levels
---

To transform data, we may have to swap the level of the data frame

The `swaplevel` method can be used to swap the level
```python
frame.swaplevel('key1','key2')
```

In [81]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

The index is not sort, so the multi hierachy is not set. we can sort the index at any level to set the better visualization
```python
frame.sort_index(level=1)
```

In [82]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

So swap the key and sort will make the hierarchy better
```python
frame.swaplevel(0,1).sort_index(level=0)
```

In [83]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

The `sort_index` method can be used to sort the index
```python
frame.swaplevel(0,1).sort_index(level=0)
```

In [84]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## Summary Statistics by Level
---

The statistic data can be calculated with the specific level
For example, if we want to calculate on the rows data

We can calculate the sum of the data by the level
```python
frame.sum()
```

In [85]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

then try
```python
frame.groupby(['key2']).sum()
```

In [86]:
frame.groupby(['key2']).sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

Or calculate on the column-wise
```python
frame.sum(axis=1)
```

In [87]:
frame.sum(axis=1)

key1  key2
a     1        3
      2       12
b     1       21
      2       30
dtype: int64

then try
```python
frame.groupby(['color'],axis=1).sum()
```

In [88]:
frame.groupby(['color'],axis=1).sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## Indexing with DataFrame's Column


some time we want to use the row index as the columns
```python
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame
```

In [89]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

We can create a new data frame using some columns as index

```python
frame2 = frame.set_index(['c','d'])
frame2
```

In [90]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

By default, the column is removed from the source data frame. However, if we do not want to remove the column, the `drop` parameter is passed
```python
frame.set_index(['c','d'],drop = False)
```

In [91]:
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

### Work



From the given [./file/car_details.xlsx](./file/car_details.xlsx)

provided the hierarchy data frame which carbrand, carmodel, and the model_name TH is a key indexes

In [112]:
import pandas as pd

excel_path = 'C:/Users/Dell/Desktop/LectureNote/LectureNote_660632028/07. Data Cleansing/file/cardetails.xlsx'
df = pd.read_excel(excel_path)

df.head()

,Table 1,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,serialNo,car_brand,car_model,model_name_th,nickname,item_name,fitment_detail,standard_price
1,IC-0000001,AUDI,Q5,à¸„à¸´à¸§5,à¹‚à¸‰à¸¡à¸›à¸µ 2008-2016,à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡,-,NaN
2,IC-0000002,BMW,SERIES 5,à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5,à¹‚à¸‰à¸¡à¸›à¸µ 2003-2010 (E60),à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡,-,NaN
3,IC-0000003,BMW,SERIES 5,à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5,à¹‚à¸‰à¸¡à¸›à¸µ 2010-2017 (F10),à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡,-,NaN
4,JA-0000001,BMW,SERIES 5,à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5,à¹‚à¸‰à¸¡à¸›à¸µ 2010-2017 (F10),à¹ƒà¸šà¸›à¸±à¸”à¸™à¹‰à¸³à¸à¸™,-,NaN

In [113]:
df = pd.read_excel(excel_path, header=1)

df.set_index(['car_brand', 'car_model', 'model_name_th'], inplace=True)

df.head()

                                     serialNo               nickname  \
car_brand car_model model_name_th
AUDI      Q5        à¸„à¸´à¸§5           IC-0000001        à¹‚à¸‰à¸¡à¸›à¸µ 2008-2016
BMW       SERIES 5  à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5       IC-0000002  à¹‚à¸‰à¸¡à¸›à¸µ 2003-2010 (E60)
                    à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5       IC-0000003  à¹‚à¸‰à¸¡à¸›à¸µ 2010-2017 (F10)
                    à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5       JA-0000001  à¹‚à¸‰à¸¡à¸›à¸µ 2010-2017 (F10)
          X1        à¹€à¸­à¹‡à¸à¸‹à¹Œ1        IC-0000006  à¹‚à¸‰à¸¡à¸›à¸µ 2009-2015 (E84)

                                              item_name fitment_detail  \
car_brand car_model model_name_th
AUDI      Q5        à¸„à¸´à¸§5           à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡              -
BMW       SERIES 5  à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5       à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡              -
                    à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5       à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡              -
                    à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5                 à¹ƒà¸šà¸›à¸±à¸”à¸™à¹‰à¸³à¸à¸™              -
          X1        à¹€à¸­à¹‡à¸à¸‹à¹Œ1        à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡              -

                                  standard_price
car_brand car_model model_name_th
AUDI      Q5        à¸„à¸´à¸§5                     NaN
BMW       SERIES 5  à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5                 NaN
                    à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5                 NaN
                    à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5                 NaN
          X1        à¹€à¸­à¹‡à¸à¸‹à¹Œ1                  NaN

Then try to find the average standard price for  each car brand, ignore the `NA` value

In [114]:
df['standard_price'] = pd.to_numeric(df['standard_price'], errors='coerce')

average_standard_price = df['standard_price'].groupby('car_brand').mean()

average_standard_price

car_brand
AUDI                  NaN
BMW           1400.000000
CHEVROLET      912.181208
FORD           829.821429
HONDA          852.875000
                 ...
SUBARU        1525.000000
SUZUKI         684.418605
TOYOTA         827.225443
VOLKSWAGEN    1436.666667
VOLVO                 NaN
Name: standard_price, Length: 21, dtype: float64